# Taps
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "tw93/tap"

# Shell & terminal tools
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "fd"
brew "ripgrep"
brew "git-delta"
brew "stow"

# Git / dev tools
brew "gh"
brew "lazygit"
brew "neovim"
brew "yazi"

# Media / docs
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"
brew "poppler"
brew "yt-dlp"
brew "tree-sitter"
brew "watchman"

# Languages & package managers
brew "node", link: false
brew "nvm"
brew "oven-sh/bun/bun"
brew "python@3.13"
brew "uv"
brew "go"
brew "openjdk"
brew "cmake"

# Infra
brew "docker"
brew "redis"

# Mobile dev (React Native)
brew "cocoapods"
brew "fastlane"

# Misc
brew "mole"
brew "mas"

# GUI apps
cask "nikitabobko/tap/aerospace"
cask "tw93/tap/kakuku"
cask "claude-code"
cask "codex"
cask "raycast"
cask "font-jetbrains-mono-nerd-font"
cask "skim"
cask "obsidian"
cask "anki"
cask "tg-pro"
cask "helium-browser"
cask "tailscale-app"

